test/request-response-samples/login__error_returned_should_contain_root_Json_on_fault/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Header></soap:Header><soap:Body><platformMsgs:login xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:passport><platformCore:email xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">em</platformCore:email><platformCore:password xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">pwd</platformCore:password><platformCore:account xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">acc</platformCore:account></platformMsgs:passport></platformMsgs:login></soap:Body></soap:Envelope>