test/request-response-samples/login__attributes_namespace_should_be_configurable/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="urn:platform_2013_2.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns:platformFaults="urn:faults_2013_2.platform.webservices.netsuite.com"><soap:Body><platformMsgs:login xmlns:platformMsgs="urn:messages_2013_2.platform.webservices.netsuite.com" xmlns="urn:messages_2013_2.platform.webservices.netsuite.com"><platformMsgs:passport><platformCore:email xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">em</platformCore:email><platformCore:password xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">pwd</platformCore:password><platformCore:account xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com">acc</platformCore:account><platformCore:role internalId="3" externalId="2" xmlns:platformCore="urn:core_2013_2.platform.webservices.netsuite.com"></platformCore:role></platformMsgs:passport></platformMsgs:login></soap:Body></soap:Envelope>